
/*------------------------------------------------------------------*/
/* --- STC MCU International Limited -------------------------------*/
/* --- STC 1T Series MCU RC Demo -----------------------------------*/
/* --- Mobile: (86)13922805190 -------------------------------------*/
/* --- Fax: 86-0513-55012956,55012947,55012969 ---------------------*/
/* --- Tel: 86-0513-55012928,55012929,55012966 ---------------------*/
/* --- Web: www.GXWMCU.com -----------------------------------------*/
/* --- QQ:  800003751 ----------------------------------------------*/
/* If you want to use the program or the program referenced in the  */
/* article, please specify in which data and procedures from STC    */
/*------------------------------------------------------------------*/


#include	"delay.h"
//#include "reg51.h"
#include "intrins.h"
/*************	功能说明	**************

本程序演示跑马灯。
程序使用P2口来演示，输出低驱动。用户可以修改为别的口。

******************************************/

/*************	本地常量声明	**************/
/*************	???????????	**************/


/******************************************/

//sfr INT_CLKO = 0x8F;
//sfr WKTCL = 0XAA;
//sfr WKTCH = 0xab;
sbit INT2 = P3^4;	//Only for STC15F/L10xW
//sbit INT2 = P3^6;
sbit LED = P3^3;

/*************	本地变量声明	**************/


/*************	本地函数声明	**************/




/*************  外部函数和变量声明 *****************/




void SharkLed()
{
//	int i;
	LED = 1;
	delay_ms(50);
	LED = 0;

}

/******************** 主函数 **************************/
void main(void)
{
	u8	keeptime=100;
	WKTCL = 0XD0;
	WKTCH = 0X88;
	while(1)
	{
		_nop_();
		_nop_();
		_nop_();
		delay_ms(1);	//delay 1ms
	
		// 
		
		
			if(INT2)
			{
				SharkLed();
			}
			else
				LED = 0;
		
#if 1
		PCON |= 0x02;	//Sleep
		_nop_();
		_nop_();
		_nop_();
#endif
		delay_ms(1);	//delay 1ms
	}
}




/********************* INT2中断函数 *********************
void INT2_int (void) interrupt 10
{
	INT_CLKO &= ~(1 << 4);	//INT2 Disable	
}
****/

